---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DPartFailures.DivisionContainsNoParts
source: html/578dc5b2-b340-6742-8d72-8a8170ade8ab.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DPartFailures.DivisionContainsNoParts Property

The division contains no parts.

## Syntax (C#)
```csharp
public static FailureDefinitionId DivisionContainsNoParts { get; }
```